In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('houses_data_v2.csv')

In [3]:
data.head()

,House_Type,Size,Bedrooms,Bathrooms,Floor,Furnished,For_rent,Region,City,Price
0,Apartment,170,3,2,9,No,No,Zahraa Al Maadi,Cairo,1546400
1,Apartment,104,2,1,7,No,No,Nasr City,Cairo,950000
2,Apartment,160,3,2,1,No,No,Mostakbal City,Cairo,2100000
3,Apartment,160,3,3,Ground,No,No,New Cairo - El Tagamoa,Cairo,3994232
4,Apartment,145,3,2,3,No,No,New Cairo - El Tagamoa,Cairo,370000

In [4]:
data.shape

(23347, 10)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23347 entries, 0 to 23346
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   House_Type  23347 non-null  object
 1   Size        23347 non-null  int64
 2   Bedrooms    23347 non-null  int64
 3   Bathrooms   23347 non-null  int64
 4   Floor       23347 non-null  object
 5   Furnished   23347 non-null  object
 6   For_rent    23347 non-null  object
 7   Region      23347 non-null  object
 8   City        23347 non-null  object
 9   Price       23347 non-null  int64
dtypes: int64(4), object(6)
memory usage: 1.8+ MB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

House_Type
Apartment            19150
Duplex                1255
Town House             888
Stand Alone Villa      570
Penthouse              496
Studio                 448
Twin House             304
Chalet                 210
Room                    22
Standalone Villa         4
Name: count, dtype: int64
********************
Size
200    881
150    771
140    744
160    715
120    712
      ...
36       1
41       1
61       1
307      1
347      1
Name: count, Length: 368, dtype: int64
********************
Bedrooms
3    14030
2     5690
4     2508
1      744
5      375
Name: count, dtype: int64
********************
Bathrooms
2    9678
3    7628
1    4773
4    1268
Name: count, dtype: int64
********************
Floor
2          7334
3          5070
1          3455
Ground     2645
4          2052
5          1057
6           392
10+         329
7           285
10          209
8           205
9           183
Highest     131
Name: count, dtype: int64
********************
Furnished
No     20100
Yes     3247
Name: count, dtype: int64
********************
For_rent
No     16565
Yes     6782
Name: count, dtype: int64
********************
Region
New Cairo - El Tagamoa    8723
Sheikh Zayed              2303
Madinaty                  1978
New Capital City          1136
Rehab City                1110
                          ...
Basateen                     3
Boulaq Dakrour               3
Moneeb                       3
Ras El Tin                   1
Kabbary                      1
Name: count, Length: 79, dtype: int64
********************
City
Cairo         16615
Giza           4267
Alexandria     2465
Name: count, dtype: int64
********************
Price
15000      398
10000      391
12000      336
20000      301
2500000    270
          ...
1167218      1
242350       1
2488000      1
577000       1
12700        1
Name: count, Length: 3170, dtype: int64
********************

In [7]:
data.isna().sum()

House_Type    0
Size          0
Bedrooms      0
Bathrooms     0
Floor         0
Furnished     0
For_rent      0
Region        0
City          0
Price         0
dtype: int64

In [8]:
data.describe()

               Size      Bedrooms     Bathrooms         Price
count  23347.000000  23347.000000  23347.000000  2.334700e+04
mean     170.380349      2.832098      2.230908  1.374141e+06
std       64.273958      0.717415      0.833736  1.412544e+06
min        1.000000      1.000000      1.000000  2.000000e+03
25%      130.000000      2.000000      2.000000  2.200000e+04
50%      160.000000      3.000000      2.000000  9.500000e+05
75%      200.000000      3.000000      3.000000  2.400000e+06
max      400.000000      5.000000      4.000000  5.000000e+06

In [9]:
#House_Type	Size	Bedrooms	Bathrooms	Floor	Furnished	For_rent	Region	City	Price
data['House_Type'].unique()

array(['Apartment', 'Penthouse', 'Duplex', 'Studio', 'Room', 'Chalet',
       'Town House', 'Twin House', 'Standalone Villa',
       'Stand Alone Villa'], dtype=object)

In [10]:
data['Floor'].unique()

array(['9', '7', '1', 'Ground', '3', '2', '4', '6', '5', '10', '8',
       'Highest', '10+'], dtype=object)

In [11]:
data['Price'].unique()

array([1546400,  950000, 2100000, ...,   19498,   75000,   12700],
      dtype=int64)

In [12]:
def map_floor(value):
    if value == 'Ground':
        return 0
    elif value == '10+':
        return 11
    elif value == 'Highest' :
        return 12     
    else:
        return int(value)

In [13]:
data['Floor'] = data['Floor'].apply(map_floor)

In [14]:
data['Floor'].unique()

array([ 9,  7,  1,  0,  3,  2,  4,  6,  5, 10,  8, 12, 11], dtype=int64)

In [15]:
data.describe()

               Size      Bedrooms     Bathrooms         Floor         Price
count  23347.000000  23347.000000  23347.000000  23347.000000  2.334700e+04
mean     170.380349      2.832098      2.230908      2.644494  1.374141e+06
std       64.273958      0.717415      0.833736      2.170625  1.412544e+06
min        1.000000      1.000000      1.000000      0.000000  2.000000e+03
25%      130.000000      2.000000      2.000000      1.000000  2.200000e+04
50%      160.000000      3.000000      2.000000      2.000000  9.500000e+05
75%      200.000000      3.000000      3.000000      3.000000  2.400000e+06
max      400.000000      5.000000      4.000000     12.000000  5.000000e+06

In [16]:
data['Furnished'].unique()

array(['No', 'Yes'], dtype=object)

In [17]:
data['For_rent'].unique()

array(['No', 'Yes'], dtype=object)

In [18]:
def convert_bool_to_numeric(x):
    if x == 'Yes':
        return 1
    elif x == 'No':
        return 0

In [19]:
data['Furnished'] = data['Furnished'].apply(convert_bool_to_numeric)
data['For_rent'] = data['For_rent'].apply(convert_bool_to_numeric)

In [20]:
data['Furnished'].unique()

array([0, 1], dtype=int64)

In [21]:
data['For_rent'].unique()

array([0, 1], dtype=int64)

In [22]:
# House_Type	Size	Bedrooms	Bathrooms	Floor	Furnished	For_rent	Region	City	Price
data['House_Type'] = data['House_Type'].apply(lambda x: x.strip())
data['Region'] = data['Region'].apply(lambda x: x.strip())
data['City'] = data['City'].apply(lambda x: x.strip())

In [23]:
data['House_Type'].value_counts()

House_Type
Apartment            19150
Duplex                1255
Town House             888
Stand Alone Villa      570
Penthouse              496
Studio                 448
Twin House             304
Chalet                 210
Room                    22
Standalone Villa         4
Name: count, dtype: int64

In [24]:
data['Region'].value_counts()

Region
New Cairo - El Tagamoa    8723
Sheikh Zayed              2303
Madinaty                  1978
New Capital City          1136
Rehab City                1110
                          ...
Basateen                     3
Boulaq Dakrour               3
Moneeb                       3
Ras El Tin                   1
Kabbary                      1
Name: count, Length: 79, dtype: int64

In [25]:
data['City'].value_counts()

City
Cairo         16615
Giza           4267
Alexandria     2465
Name: count, dtype: int64

In [26]:
data.describe()

,Size,Bedrooms,Bathrooms,Floor,Furnished,For_rent,Price
count,23347.000000,23347.000000,23347.000000,23347.000000,23347.000000,23347.000000,2.334700e+04
mean,170.380349,2.832098,2.230908,2.644494,0.139076,0.290487,1.374141e+06
std,64.273958,0.717415,0.833736,2.170625,0.346033,0.453997,1.412544e+06
min,1.000000,1.000000,1.000000,0.000000,0.000000,0.000000,2.000000e+03
25%,130.000000,2.000000,2.000000,1.000000,0.000000,0.000000,2.200000e+04
50%,160.000000,3.000000,2.000000,2.000000,0.000000,0.000000,9.500000e+05
75%,200.000000,3.000000,3.000000,3.000000,0.000000,1.000000,2.400000e+06
max,400.000000,5.000000,4.000000,12.000000,1.000000,1.000000,5.000000e+06

In [27]:
region_count = data['Region'].value_counts()

In [28]:
region_count_less_10 = region_count[region_count<= 10]
region_count_less_10

Region
Matareya            10
Bahray - Anfoshy    10
Manshiyya           10
Ard El Lewa          9
Imbaba               9
Schutz               8
Abu Qir              5
Dar al-Salaam        5
Garden City          4
Qasr al-Nil          3
Awayed               3
Basateen             3
Boulaq Dakrour       3
Moneeb               3
Ras El Tin           1
Kabbary              1
Name: count, dtype: int64

In [29]:
data['Region']= data['Region'].apply(lambda x: 'other' if x in region_count_less_10 else x)

In [30]:
data['Region'].value_counts()

Region
New Cairo - El Tagamoa    8723
Sheikh Zayed              2303
Madinaty                  1978
New Capital City          1136
Rehab City                1110
                          ...
Giza District               16
Abu Talat                   13
15 May City                 13
Salam City                  12
Abasiya                     12
Name: count, Length: 64, dtype: int64

In [31]:
city_count = data['City'].value_counts()
city_count_less_10 = city_count[city_count<= 10]
city_count_less_10

Series([], Name: count, dtype: int64)

In [32]:
data['City']= data['City'].apply(lambda x: 'other' if x in region_count_less_10 else x)

In [33]:
data['City'].value_counts()

City
Cairo         16615
Giza           4267
Alexandria     2465
Name: count, dtype: int64

## outlier detection and removal

In [34]:
data.describe()

,Size,Bedrooms,Bathrooms,Floor,Furnished,For_rent,Price
count,23347.000000,23347.000000,23347.000000,23347.000000,23347.000000,23347.000000,2.334700e+04
mean,170.380349,2.832098,2.230908,2.644494,0.139076,0.290487,1.374141e+06
std,64.273958,0.717415,0.833736,2.170625,0.346033,0.453997,1.412544e+06
min,1.000000,1.000000,1.000000,0.000000,0.000000,0.000000,2.000000e+03
25%,130.000000,2.000000,2.000000,1.000000,0.000000,0.000000,2.200000e+04
50%,160.000000,3.000000,2.000000,2.000000,0.000000,0.000000,9.500000e+05
75%,200.000000,3.000000,3.000000,3.000000,0.000000,1.000000,2.400000e+06
max,400.000000,5.000000,4.000000,12.000000,1.000000,1.000000,5.000000e+06

In [35]:
data = data[(data['Size'])>= 300]
data

,House_Type,Size,Bedrooms,Bathrooms,Floor,Furnished,For_rent,Region,City,Price
47,Apartment,400,4,3,2,0,1,New Cairo - El Tagamoa,Cairo,15000
50,Apartment,330,3,3,3,1,1,New Cairo - El Tagamoa,Cairo,20000
57,Apartment,390,4,4,6,0,1,Heliopolis,Cairo,35000
76,Duplex,330,4,4,1,0,0,New Cairo - El Tagamoa,Cairo,3000000
104,Apartment,300,4,3,1,0,1,Nasr City,Cairo,20000
...,...,...,...,...,...,...,...,...,...,...
23201,Apartment,300,3,3,4,0,1,Dokki,Giza,35000
23227,Apartment,320,3,3,4,1,1,Agouza,Giza,60000
23229,Apartment,300,4,3,10,1,1,Agouza,Giza,3000
23230,Apartment,300,4,3,1,0,1,West Somid,Giza,20000
23269,Apartment,300,4,4,11,1,1,San Stefano,Alexandria,50000

In [36]:
data.shape

(1223, 10)

In [37]:
data.Price.describe()

count    1.223000e+03
mean     1.901491e+06
std      1.736852e+06
min      2.600000e+03
25%      3.500000e+04
50%      1.550000e+06
75%      3.500000e+06
max      5.000000e+06
Name: Price, dtype: float64

In [38]:
# Create the BHK column by summing the number of bedrooms and bathrooms, and adding 1 for the kitchen
data['BHK'] = data['Bedrooms'] + data['Bathrooms'] + 1

# Drop the Bedrooms and Bathrooms columns
data = data.drop(['Bedrooms', 'Bathrooms'], axis=1)
print(data.head())

    House_Type  Size  Floor  Furnished  For_rent                  Region  \
47   Apartment   400      2          0         1  New Cairo - El Tagamoa
50   Apartment   330      3          1         1  New Cairo - El Tagamoa
57   Apartment   390      6          0         1              Heliopolis
76      Duplex   330      1          0         0  New Cairo - El Tagamoa
104  Apartment   300      1          0         1               Nasr City

      City    Price  BHK
47   Cairo    15000    8
50   Cairo    20000    7
57   Cairo    35000    9
76   Cairo  3000000    9
104  Cairo    20000    8

In [39]:
data = data.drop([ 'Furnished', 'For_rent'], axis = 1)

In [40]:
data.shape

(1223, 7)

In [41]:
data.head()

    House_Type  Size  Floor                  Region   City    Price  BHK
47   Apartment   400      2  New Cairo - El Tagamoa  Cairo    15000    8
50   Apartment   330      3  New Cairo - El Tagamoa  Cairo    20000    7
57   Apartment   390      6              Heliopolis  Cairo    35000    9
76      Duplex   330      1  New Cairo - El Tagamoa  Cairo  3000000    9
104  Apartment   300      1               Nasr City  Cairo    20000    8

In [42]:
(data['Size']/data['BHK']).describe()

count    1223.000000
mean       43.334041
std         9.712701
min        30.000000
25%        37.500000
50%        42.857143
75%        47.142857
max       133.333333
dtype: float64

In [43]:
data = data[((data['Size']/data['BHK']) >= 30)]
data.describe()

              Size        Floor         Price          BHK
count  1223.000000  1223.000000  1.223000e+03  1223.000000
mean    337.695830     2.655765  1.901491e+06     8.002453
std      33.756503     2.247762  1.736852e+06     1.193611
min     300.000000     0.000000  2.600000e+03     3.000000
25%     302.000000     1.000000  3.500000e+04     7.000000
50%     335.000000     3.000000  1.550000e+06     8.000000
75%     360.000000     3.000000  3.500000e+06     9.000000
max     400.000000    12.000000  5.000000e+06    10.000000

In [44]:
data.shape

(1223, 7)

In [45]:
data.Price.describe()

count    1.223000e+03
mean     1.901491e+06
std      1.736852e+06
min      2.600000e+03
25%      3.500000e+04
50%      1.550000e+06
75%      3.500000e+06
max      5.000000e+06
Name: Price, dtype: float64

In [46]:
data.head(2)

   House_Type  Size  Floor                  Region   City  Price  BHK
47  Apartment   400      2  New Cairo - El Tagamoa  Cairo  15000    8
50  Apartment   330      3  New Cairo - El Tagamoa  Cairo  20000    7

In [47]:
# Create the 'location' column by concatenating 'City' and 'Region'
data['location'] = data['City'] + ', ' + data['Region']

# Drop the 'City' and 'Region' columns
data = data.drop(['City', 'Region'], axis=1)

# Display the first few rows to check the result

In [48]:
print(data.head(2))

   House_Type  Size  Floor  Price  BHK                       location
47  Apartment   400      2  15000    8  Cairo, New Cairo - El Tagamoa
50  Apartment   330      3  20000    7  Cairo, New Cairo - El Tagamoa

In [49]:
def remove_outliers_size(df):
    df_output = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf['Price'])
        st = np.std(subdf['Price'])
        # Properly group each condition with parentheses
        gen_df = subdf[(subdf['Price'] > (m - st)) & (subdf['Price'] <= (m + st))]
        df_output = pd.concat([df_output, gen_df], ignore_index=True)
    return df_output

# Apply the function to the data
data = remove_outliers_size(data)

# Describe the cleaned data
print(data.describe())

             Size       Floor         Price         BHK
count  630.000000  630.000000  6.300000e+02  630.000000
mean   339.349206    2.901587  1.692151e+06    8.092063
std     32.930267    2.238519  1.295032e+06    1.169743
min    300.000000    0.000000  2.600000e+03    3.000000
25%    306.000000    2.000000  4.790000e+05    7.000000
50%    337.000000    3.000000  1.600000e+06    8.000000
75%    365.000000    3.000000  2.799172e+06    9.000000
max    400.000000   12.000000  5.000000e+06   10.000000

In [50]:
def BHK_outlier_remover(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats ={}
        for bhk , bhk_df in location_df.groupby('BHK'):
            bhk_stats[bhk]= {
                'mean': np.mean(bhk_df.Price),
                'std': np.std(bhk_df.Price),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('BHK'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count'] > 5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.Price<(stats['mean'])].index.values)
    return df.drop(exclude_indices, axis = 'index')

In [51]:
data = BHK_outlier_remover(data)

In [52]:
data.shape

(418, 6)

In [53]:
data

            House_Type  Size  Floor    Price  BHK                     location
0               Duplex   350     11    40000    6  Alexandria, Al Ibrahimiyyah
1            Apartment   360      9  3200000    8           Alexandria, Bolkly
2    Stand Alone Villa   400      4  2200000    8     Alexandria, Borg al-Arab
3    Stand Alone Villa   380      4  1800000    8     Alexandria, Borg al-Arab
4    Stand Alone Villa   400      4  3300000    9     Alexandria, Borg al-Arab
..                 ...   ...    ...      ...  ...                          ...
625          Apartment   340      2     8500    8             Giza, West Somid
626          Apartment   300      2    13000    8             Giza, West Somid
627          Apartment   300      2    25000    8             Giza, West Somid
628          Apartment   300      1    25000    8             Giza, West Somid
629          Apartment   300      1    20000    8             Giza, West Somid

[418 rows x 6 columns]

## Cleaned Data

In [54]:
data.head()

          House_Type  Size  Floor    Price  BHK                     location
0             Duplex   350     11    40000    6  Alexandria, Al Ibrahimiyyah
1          Apartment   360      9  3200000    8           Alexandria, Bolkly
2  Stand Alone Villa   400      4  2200000    8     Alexandria, Borg al-Arab
3  Stand Alone Villa   380      4  1800000    8     Alexandria, Borg al-Arab
4  Stand Alone Villa   400      4  3300000    9     Alexandria, Borg al-Arab

In [55]:
data.to_csv('Cleaned_data.csv')

In [56]:
X= data.drop(columns=['Price'])
y = data['Price']
X, y

(            House_Type  Size  Floor  BHK                     location
 0               Duplex   350     11    6  Alexandria, Al Ibrahimiyyah
 1            Apartment   360      9    8           Alexandria, Bolkly
 2    Stand Alone Villa   400      4    8     Alexandria, Borg al-Arab
 3    Stand Alone Villa   380      4    8     Alexandria, Borg al-Arab
 4    Stand Alone Villa   400      4    9     Alexandria, Borg al-Arab
 ..                 ...   ...    ...  ...                          ...
 625          Apartment   340      2    8             Giza, West Somid
 626          Apartment   300      2    8             Giza, West Somid
 627          Apartment   300      2    8             Giza, West Somid
 628          Apartment   300      1    8             Giza, West Somid
 629          Apartment   300      1    8             Giza, West Somid

 [418 rows x 5 columns],
 0        40000
 1      3200000
 2      2200000
 3      1800000
 4      3300000
         ...
 625       8500
 626      13000
 627      25000
 628      25000
 629      20000
 Name: Price, Length: 418, dtype: int64)

In [75]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.pipeline import Pipeline
from sklearn.linear_model import LinearRegression, Ridge
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score

In [68]:
# Define the preprocessing pipeline
def preprocess_data(X_train, X_test):
    # Ensure consistent categories for OneHotEncoder
    unique_location_categories = list(X_train['location'].unique())
    unique_house_type_categories = list(X_train['House_Type'].unique())
    
    # Creating the column transformer
    column_trans = ColumnTransformer(
        transformers=[
            ('location', OneHotEncoder(sparse=False, categories=[unique_location_categories], handle_unknown='ignore'), ['location']),
            ('house_type', OneHotEncoder(sparse=False, categories=[unique_house_type_categories], handle_unknown='ignore'), ['House_Type']),
            ('scaler', StandardScaler(), ['Size', 'Floor', 'BHK'])
        ],
        remainder='passthrough'
    )
    
    return column_trans

In [69]:

# Preprocess the data
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)
column_trans = preprocess_data(X_train, X_test)

## Applying Linear Regression

In [71]:
lr = LinearRegression()
pipe = Pipeline([
    ('preprocessor', column_trans),
    ('regressor', lr)
])
pipe.fit(X_train, y_train)

# Make predictions
y_pred_lr = pipe.predict(X_test)
# Print predictions
print("Predictions:", y_pred_lr)

# Optionally, evaluate the model
print("R^2 Score:", r2_score(y_test, y_pred_lr))

Predictions: [ 4.47718400e+06  2.63884800e+06  6.80448000e+05  4.54809600e+06
  3.76243200e+06  3.80646400e+06  2.46707200e+06  2.55180800e+06
 -5.01760000e+04  8.24320000e+04  2.13964800e+06  1.48710400e+06
  3.09401600e+06  2.65702400e+06  4.19123200e+06  1.79635200e+06
  2.86924800e+06  2.79500800e+06  2.34547200e+06  2.78988800e+06
  2.03187200e+06  1.07520000e+04  3.00569600e+06  9.05216000e+05
  2.05900800e+06  1.41568000e+06  2.85772800e+06  2.34393600e+06
  2.65446400e+06  3.80646400e+06  3.09811200e+06  9.85856000e+05
  1.41747200e+06  4.16409600e+06 -5.12000000e+04  1.25670400e+06
  3.46086400e+06  2.41433600e+06  1.73030400e+06  9.39264000e+05
  4.67481600e+06  1.83603200e+06  1.66092800e+06  2.77683200e+06
 -8.58717403e+13  2.75840000e+06  2.82931200e+06  3.04435200e+06
  1.51756800e+06  3.97388800e+06  4.65920000e+04  2.55180800e+06
 -8.58717405e+13  3.66515200e+06  2.78809600e+06 -1.33376000e+05
 -8.93440000e+04  2.61657600e+06  9.35680000e+05  1.64684800e+06
  2.80192000e+06  1.79020800e+06  2.72716800e+06  2.77632000e+06
  2.71385600e+06  2.31526400e+06  8.20736000e+05  8.61184000e+05
 -3.20000000e+05  7.83104000e+05  2.74329600e+06  2.43404800e+06
  9.45408000e+05  3.04435200e+06  2.40486400e+06  8.73472000e+05
  2.53721600e+06  2.79500800e+06  3.78752000e+06  1.39468800e+06
  2.55180800e+06 -3.49440000e+05  1.83705600e+06  3.76576000e+06]
R^2 Score: -95111816074968.14

D:\college\python\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(
D:\college\python\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

### Applying Lasso

In [73]:
lasso = Lasso(alpha = 0.1)

In [74]:
pipe = Pipeline([
    ('preprocessor', column_trans),
    ('regressor', lasso)
])
pipe.fit(X_train, y_train)

# Make predictions
y_pred_lasso = pipe.predict(X_test)

# Print predictions
print("Predictions:", y_pred_lasso)

# Optionally, evaluate the model
print("R^2 Score:", r2_score(y_test, y_pred_lasso))

Predictions: [4476837.07438808 2638207.42033342  681678.42265501 4547423.30440078
 3761244.55466663 3805418.34962634 2466786.10192795 2553233.98449633
  -50542.73803805   82589.18491349 2139486.72001522 1487799.30183882
 3094707.83621181 2656793.84163904 4189896.57280835 1796796.30754072
 2870068.89971875 2794257.54855012 2347242.67788907 2788883.91269664
 2031422.80339591    5859.60504029 3007142.9358819   906518.52595384
 2057912.149971   1416665.24798714 2856471.64859037 2344849.36447561
 2655913.14111507 3805418.34962634 3099205.24787722  986789.25660411
 1416862.57914431 4165136.03050043  -51021.14957228 1256133.60952177
 3460322.61290175 2413731.62701488 1730915.82619553  939577.59228291
 4673954.5998896  1836264.35383292 1661786.09292782 2778332.21504638
 1660418.51141903 2758459.03050625 2828922.15161303 3045319.74260367
 1518226.67194653 3973157.42235081   46923.34825744 2553233.98449633
 1422312.35963895 3665093.21840059 2787755.15727466 -133113.83200761
  -88940.0370479  2616333.83886919  936733.27581001 1647668.84692528
 2800648.28436542 1790268.50192112 2726555.01025284 2775990.78560588
 2713639.61576133 2314734.72217956  822000.46051386  862344.73099413
 -321058.31310906  784329.05682961 2742865.13435801 2435590.26780849
  946613.28885735 3045319.74260367 2403773.12571177  874364.99812368
 2538585.92111212 2794257.54855012 3786595.35495628 1393839.23884426
 2553233.98449633 -350584.04468457 1837440.7909998  3764659.06376372]
R^2 Score: 0.6452702381527297

D:\college\python\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(
D:\college\python\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(
D:\college\python\Lib\site-packages\sklearn\linear_model\_coordinate_descent.py:628: ConvergenceWarning: Objective did not converge. You might want to increase the number of iterations, check the scale of the features or consider increasing regularisation. Duality gap: 3.735e+13, tolerance: 5.900e+10
  model = cd_fast.enet_coordinate_descent(

### applying rigde

In [76]:

# Create and fit the pipeline with Ridge regression
ridge = Ridge(alpha=1.0)  # You can adjust the alpha parameter as needed
pipe = Pipeline([
    ('preprocessor', column_trans),
    ('regressor', ridge)
])
pipe.fit(X_train, y_train)

# Make predictions
y_pred_ridge = pipe.predict(X_test)

# Print predictions
print("Predictions:", y_pred_ridge)

# Optionally, evaluate the model
print("R^2 Score:", r2_score(y_test, y_pred_ridge))

Predictions: [4000011.44086295 2652525.29145032  674957.06115636 4070557.31279872
 3680469.83588023 3711743.14550093 2417266.62709783 2416580.80374381
  251549.7008393   183292.87078136 2062502.0066421  1445579.69381749
 3085577.35092    2668629.28475753 3779177.04588179 1811097.29592329
 2798473.27270573 2769860.51095767 2236457.73127612 2794794.941316
 1963892.67396353  682932.25327511 2967757.5225129   939408.6644606
 2113194.18404494 1395438.80073593 2875219.26226027 2226251.89703616
 2642919.78936443 3711743.14550093 3040995.65552499  994727.71687109
 1371537.81448657 3597695.42595347  177230.5976571  1290048.98719638
 3324105.28324278 2389992.94382431 1745254.48211657  993137.15078895
 4253972.70475132 1837667.54741494 1665729.16733738 2714850.55710565
 1482097.67059139 2729268.75030091 2814966.64088287 3018787.7301506
 1477072.26939884 3846667.43647916  256347.5533305  2416580.80374381
 1272526.62042419 3577347.13721661 2784298.5842858    12235.18255999
   43508.49218069 2549039.91993331  957575.58458908 1651619.99295022
 2806552.58663863 1817448.451335   2715071.91069171 2772540.93896317
 2710225.41875324 2324118.54095651  861917.83831157  908135.3548399
   22462.98637403  816206.45536275 2732455.31188591 2299004.35051752
  958071.20463238 3018787.7301506  2399148.20506068  897656.84849485
 2389065.88675136 2769860.51095767 3692930.91298472 1353341.34853019
 2416580.80374381   18704.59374577 1838843.3119472  3709632.85015533]
R^2 Score: 0.6513756018705166

D:\college\python\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(
D:\college\python\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [78]:
print('No Regularization: ', r2_score(y_test, y_pred_lr))
print('Lasso: ', r2_score(y_test, y_pred_lasso))
print('Ridge: ', r2_score(y_test, y_pred_ridge))

No Regularization:  -95111816074968.14
Lasso:  0.6452702381527297
Ridge:  0.6513756018705166

In [79]:
import pickle

In [80]:
pickle.dump(pipe, open('RidgeModel.pkl', 'wb'))